---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.ReverseIterator
source: html/66b3618d-614c-ba19-7cf6-ca0ebb648ecf.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual MEPBuildingConstructionSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.